---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.EditingFailures.GeneratedByMassing
source: html/ad1f6f2c-174e-a8b4-d031-1fff9b9d5f75.htm
---
# Autodesk.Revit.DB.BuiltInFailures.EditingFailures.GeneratedByMassing Property

Selected element(s) produced from Massing shape. Once deleted, the selected element(s) will not be regenerated

## Syntax (C#)
```csharp
public static FailureDefinitionId GeneratedByMassing { get; }
```